studyguide.org
* Chapter 1
** Propositional Logic
*** Converse Contrapositive and Inverse (p -> q)
**** Coverse
***** q \rightarrow  p
**** Contrapositive
***** q \rightarrow \textlnot{}p
**** Inverse
***** \textlnot{}p \rightarrow \textlnot{}q
** Applications of Propositional Logic
*** Examples of turning sentences into propositional Logic.
** Propositional Equivalences
*** Logical Equivalences
|---------------------------+---------------------------------+----------------------|
| p\wedge T                 | p                               | Identity Laws        |
| p\vee F                   | p                               |                      |
|---------------------------+---------------------------------+----------------------|
| p\vee T                   | T                               | Domination Laws      |
| p\wedge F                 | F                               |                      |
|---------------------------+---------------------------------+----------------------|
| p\vee p                   | p                               | Idempotent Laws      |
| p\wedge p                 | p                               |                      |
|---------------------------+---------------------------------+----------------------|
| \textlnot{}(\textlnot{}p) | p                               | Double Negation Laws |
|---------------------------+---------------------------------+----------------------|
| p\vee q                   | q\vee p                         | Commutative Laws     |
| p\wedge q                 | q \wedge p                      |                      |
|---------------------------+---------------------------------+----------------------|
| (p\vee q)\vee r           | p\vee (q\vee r)                 | Associative Laws     |
| (p\wedge q) \wedge r      | p \wedge (q \wedge r)           |                      |
|---------------------------+---------------------------------+----------------------|
| p\vee (q\wedge r)         | (p\vee q) \wedge (p\vee r)      | Distributive Laws    |
| p \wedge (q\vee r)        | (p\wedge q)\vee (p \wedge r)    |                      |
|---------------------------+---------------------------------+----------------------|
| \textlnot{}(p\wedge q)    | \textlnot{}p\vee \textlnot{}q   | De Morgans Laws      |
| \textlnot{}(p v q)        | \textlnot{}p\wedge \textlnot{}q |                      |
|---------------------------+---------------------------------+----------------------|
| p\vee (p\wedge q)         | p                               | Absorption Laws      |
| p \wedge (p\vee q)        | p                               |                      |
|---------------------------+---------------------------------+----------------------|
| p v \textlnot{}p          | T                               | Negation Laws        |
| p\wedge \textlnot{}p      | F                               |                      |
|---------------------------+---------------------------------+----------------------|

