studyguide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>studyguide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="studyguide"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-10-17T21:02-0400"/>
<meta name="author" content="Shantanu Vyas"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">studyguide</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Chapter 1</a>
<ul>
<li><a href="#sec-1-1">1.1 Propositional Logic</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Converse Contrapositive and Inverse (p -&gt; q)</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Applications of Propositional Logic</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Examples of turning sentences into propositional Logic.</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Propositional Equivalences</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Logical Equivalences</a></li>
<li><a href="#sec-1-3-2">1.3.2 Logical Equivelances Involving Conditional Statements</a></li>
<li><a href="#sec-1-3-3">1.3.3 Logical Equivalences Involving Biconditional Statements</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Predicates and Quantifiers</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Quantifiers</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 Nested Quantifers</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 Nested Quantifiers can be used when there are multiple variables such as x and y</a></li>
<li><a href="#sec-1-5-2">1.5.2 Quantification of Two Variables</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 Rules of Inference</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 Rules of inference</a></li>
<li><a href="#sec-1-6-2">1.6.2 Rules of Inference for Quantifies Statements</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 Introduction to Proofs</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 There are 3 main methods for proofs.</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8 Proof methods and Strategy</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1 Exhaustive Proof</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Chapter 2</a>
<ul>
<li><a href="#sec-2-1">2.1 Sets</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Definition</a></li>
<li><a href="#sec-2-1-2">2.1.2 Number sets</a></li>
<li><a href="#sec-2-1-3">2.1.3 Interval Notation</a></li>
<li><a href="#sec-2-1-4">2.1.4 Empty Set</a></li>
<li><a href="#sec-2-1-5">2.1.5 Subsets</a></li>
<li><a href="#sec-2-1-6">2.1.6 Proper Subset</a></li>
<li><a href="#sec-2-1-7">2.1.7 Set Cardinality</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Set Operations</a></li>
<li><a href="#sec-2-3">2.3 Functions</a></li>
<li><a href="#sec-2-4">2.4 Sequences and Summations</a></li>
<li><a href="#sec-2-5">2.5 Cardinality of Sets</a></li>
<li><a href="#sec-2-6">2.6 Matrices</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Chapter 1</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Propositional Logic</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Converse Contrapositive and Inverse (p -&gt; q)</h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li id="sec-1-1-1-1">Coverse<br/>
<ul>
<li id="sec-1-1-1-1-1">q &rarr;  p<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-1-1-2">Contrapositive<br/>
<ul>
<li id="sec-1-1-1-2-1">q &rarr; \textlnot{}p<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-1-1-3">Inverse<br/>
<ul>
<li id="sec-1-1-1-3-1">\textlnot{}p &rarr; \textlnot{}q<br/>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Applications of Propositional Logic</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Examples of turning sentences into propositional Logic.</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Propositional Equivalences</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Logical Equivalences</h4>
<div class="outline-text-4" id="text-1-3-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">p&and; T</th><th scope="col" class="left">p</th><th scope="col" class="left">Identity Laws</th></tr>
<tr><th scope="col" class="left">p&or; F</th><th scope="col" class="left">p</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="left">p&or; T</td><td class="left">T</td><td class="left">Domination Laws</td></tr>
<tr><td class="left">p&and; F</td><td class="left">F</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; p</td><td class="left">p</td><td class="left">Idempotent Laws</td></tr>
<tr><td class="left">p&and; p</td><td class="left">p</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">\textlnot{}(\textlnot{}p)</td><td class="left">p</td><td class="left">Double Negation Laws</td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; q</td><td class="left">q&or; p</td><td class="left">Commutative Laws</td></tr>
<tr><td class="left">p&and; q</td><td class="left">q &and; p</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">(p&or; q)&or; r</td><td class="left">p&or; (q&or; r)</td><td class="left">Associative Laws</td></tr>
<tr><td class="left">(p&and; q) &and; r</td><td class="left">p &and; (q &and; r)</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; (q&and; r)</td><td class="left">(p&or; q) &and; (p&or; r)</td><td class="left">Distributive Laws</td></tr>
<tr><td class="left">p &and; (q&or; r)</td><td class="left">(p&and; q)&or; (p &and; r)</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">\textlnot{}(p&and; q)</td><td class="left">\textlnot{}p&or; \textlnot{}q</td><td class="left">De Morgans Laws</td></tr>
<tr><td class="left">\textlnot{}(p v q)</td><td class="left">\textlnot{}p&and; \textlnot{}q</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; (p&and; q)</td><td class="left">p</td><td class="left">Absorption Laws</td></tr>
<tr><td class="left">p &and; (p&or; q)</td><td class="left">p</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p v \textlnot{}p</td><td class="left">T</td><td class="left">Negation Laws</td></tr>
<tr><td class="left">p&and; \textlnot{}p</td><td class="left">F</td><td class="left"></td></tr>
</tbody>
</table>


</div>

</div>
