studyguide.tex
% Created 2016-10-17 Mon 21:02
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{studyguide}
\author{Shantanu Vyas}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Chapter 1}
\label{sec-1}
\subsection{Propositional Logic}
\label{sec-1-1}
\subsubsection{Converse Contrapositive and Inverse (p -> q)}
\label{sec-1-1-1}
\begin{itemize}

\item Coverse
\label{sec-1-1-1-1}%
\begin{itemize}

\item q $\rightarrow$  p
\label{sec-1-1-1-1-1}%
\end{itemize} % ends low level

\item Contrapositive
\label{sec-1-1-1-2}%
\begin{itemize}

\item q $\rightarrow$ \textlnot{}p
\label{sec-1-1-1-2-1}%
\end{itemize} % ends low level

\item Inverse
\label{sec-1-1-1-3}%
\begin{itemize}

\item \textlnot{}p $\rightarrow$ \textlnot{}q
\label{sec-1-1-1-3-1}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Applications of Propositional Logic}
\label{sec-1-2}
\subsubsection{Examples of turning sentences into propositional Logic.}
\label{sec-1-2-1}
\subsection{Propositional Equivalences}
\label{sec-1-3}
\subsubsection{Logical Equivalences}
\label{sec-1-3-1}


\begin{center}
\begin{tabular}{lll}
\hline
 p\wedge T                  &  p                                &  Identity Laws         \\
 p\vee F                    &  p                                &                        \\
\hline
 p\vee T                    &  T                                &  Domination Laws       \\
 p\wedge F                  &  F                                &                        \\
\hline
 p\vee p                    &  p                                &  Idempotent Laws       \\
 p\wedge p                  &  p                                &                        \\
\hline
 \textlnot{}(\textlnot{}p)  &  p                                &  Double Negation Laws  \\
\hline
 p\vee q                    &  q\vee p                          &  Commutative Laws      \\
 p\wedge q                  &  q \wedge p                       &                        \\
\hline
 (p\vee q)\vee r            &  p\vee (q\vee r)                  &  Associative Laws      \\
 (p\wedge q) \wedge r       &  p \wedge (q \wedge r)            &                        \\
\hline
 p\vee (q\wedge r)          &  (p\vee q) \wedge (p\vee r)       &  Distributive Laws     \\
 p \wedge (q\vee r)         &  (p\wedge q)\vee (p \wedge r)     &                        \\
\hline
 \textlnot{}(p\wedge q)     &  \textlnot{}p\vee \textlnot{}q    &  De Morgans Laws       \\
 \textlnot{}(p v q)         &  \textlnot{}p\wedge \textlnot{}q  &                        \\
\hline
 p\vee (p\wedge q)          &  p                                &  Absorption Laws       \\
 p \wedge (p\vee q)         &  p                                &                        \\
\hline
 p v \textlnot{}p           &  T                                &  Negation Laws         \\
 p\wedge \textlnot{}p       &  F                                &                        \\
\hline
\end{tabular}
\end{center}
