studyguide.html

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Logical Equivelances Involving Conditional Statements</h4>
<div class="outline-text-4" id="text-1-3-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">p &rarr; q</th><th scope="col" class="left">\textlnot{}p&or; q</th></tr>
</thead>
<tbody>
<tr><td class="left">p &rarr; q</td><td class="left">\textlnot{}q &rarr; \textlnot{}p</td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; q</td><td class="left">\textlnot{}p &rarr; q</td></tr>
</tbody>
<tbody>
<tr><td class="left">p&and;  q</td><td class="left">\textlnot{}(p &rarr; \textlnot{}q)</td></tr>
</tbody>
<tbody>
<tr><td class="left">\textlnot{}(p &rarr; q)</td><td class="left">p&and; q</td></tr>
</tbody>
<tbody>
<tr><td class="left">(p &rarr; q)&and; (p &rarr; r)</td><td class="left">p &rarr; (q &and; r)</td></tr>
</tbody>
<tbody>
<tr><td class="left">(p &rarr; r)&and; (q &rarr; r)</td><td class="left">(p&or; q) &rarr; r</td></tr>
</tbody>
<tbody>
<tr><td class="left">(p &rarr; q)&or; (p &rarr; r)</td><td class="left">p &rarr; (q&or; r)</td></tr>
</tbody>
<tbody>
<tr><td class="left">(p &rarr; r)&or; (q &rarr; r)</td><td class="left">(p&and; q) &rarr; r</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Logical Equivalences Involving Biconditional Statements</h4>
<div class="outline-text-4" id="text-1-3-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">p &harr; q</th><th scope="col" class="left">(p &rarr; q)&and; (q &rarr; p)</th></tr>
</thead>
<tbody>
<tr><td class="left">p &harr; q</td><td class="left">\textlnot{}p &harr; \textlnot{}q</td></tr>
</tbody>
<tbody>
<tr><td class="left">p &harr; q</td><td class="left">(p&and; q)&or; (\textlnot{}p &and; \textlnot{}q)</td></tr>
</tbody>
<tbody>
<tr><td class="left">\textlnot{}(p &harr; q)</td><td class="left">p &harr; \textlnot{}q</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Predicates and Quantifiers</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Quantifiers</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li id="sec-1-4-1-1">Universal Quantifer<br/>
<ul>
<li id="sec-1-4-1-1-1">&forall;(x) P(x)<br/>
<ul>
<li id="sec-1-4-1-1-1-1">Definition: For all x in the universe P(x) is true;<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-1-1-1-2">Negation<br/>
<ul>
<li id="sec-1-4-1-1-1-2-1">\textlnot{}&forall;(x) P(x) can also be written as &exist;\textlnot{} P(x)<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-1-1-1-2-2">There exists an x such that P(x) is false<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-4-1-2">Existential Quantifer<br/>
<ul>
<li id="sec-1-4-1-2-1">&exist;(x) P(x)<br/>
<ul>
<li id="sec-1-4-1-2-1-1">Definition: For all x in the universe P(x) is true for at least one x;<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-1-2-1-2">Negation<br/>
<ul>
<li id="sec-1-4-1-2-1-2-1">\textlnot{}&exist;(x) P(x) can also be written as &forall;\textlnot{} P(x)<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-1-2-1-2-2">All x in the universe make P(x) false<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Nested Quantifers</h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Nested Quantifiers can be used when there are multiple variables such as x and y</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li id="sec-1-5-1-1">&forall; (x) &exist; (y) (x + y = 0)<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Quantification of Two Variables</h4>
<div class="outline-text-4" id="text-1-5-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Statement</th><th scope="col" class="left">When True</th><th scope="col" class="left">When False</th></tr>
</thead>
<tbody>
<tr><td class="left">&forall; (x) &forall; (y) P(x,y)</td><td class="left">P(x,y) is true for every pair</td><td class="left">When there is a x,y</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">for which P(x,y) is false</td></tr>
</tbody>
<tbody>
<tr><td class="left">&forall; (x) &exist; (y) P(x,y)</td><td class="left">For every x there is a y</td><td class="left">When there is an x such</td></tr>
<tr><td class="left"></td><td class="left">for which P(x,y) is true</td><td class="left">that P(x,y) is false for every y</td></tr>
</tbody>
<tbody>
<tr><td class="left">&exist; (x) &forall; (y) P(x,y)</td><td class="left">There is an x for which P(x,y)</td><td class="left">When for every x there is a y</td></tr>
<tr><td class="left"></td><td class="left">is true for every y</td><td class="left">for which P(x,y) is false</td></tr>
</tbody>
<tbody>
<tr><td class="left">&exist; (x) &exist; (y) P(x,y)</td><td class="left">There is a pair for x,y</td><td class="left">P(x,y) is false for</td></tr>
<tr><td class="left">&exist; (y) &exist; (x) P(x,y)</td><td class="left">for which P(x,y) is true</td><td class="left">every pair of x and y</td></tr>
</tbody>
</table>


</div>
</div>

</div>
