studyguide.org
*** Rules of inference 
|-------------------+----------------------------------------------------------------+----------------|
| Rule of Inference | Tautology                                                      | Name           |
|-------------------+----------------------------------------------------------------+----------------|
| p                 | (p\wedge (p \rightarrow q)) \rightarrow q                      | Modus Ponens   |
| p \rightarrow q   |                                                                |                |
| ---------------   |                                                                |                |
| q                 |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| \textlnot q       | (\textlnot q \wedge (p \rightarrow q)) \rightarrow \textlnot p | Modus Tollens  |
| p \rightarrow q   |                                                                |                |
| ---------------   |                                                                |                |
| \textlnot p       |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p \rightarrow q   | ((p \vee q) \wedge \textlnot p) \rightarrow q                  | Hypothetical   |
| q \rightarrow r   |                                                                | Syllogism      |
| ---------------   |                                                                |                |
| p  \rightarrow r  |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p\vee q           | p \rightarrow (p \vee q)                                       | Disjunctive    |
| \textlnot p       |                                                                | Syllogism      |
| ---------------   |                                                                |                |
| q                 |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p                 | p \rightarrow (p\vee q)                                        | Addition       |
| ---------------   |                                                                |                |
| p\vee q           |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p\wedge q         | (p\wedge q) \rightarrow p                                      | Simplification |
| ---------------   |                                                                |                |
| p                 |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p                 | ((p)\wedge(q)) \rightarrow (p \wedge q)                        | Conjunction    |
| q                 |                                                                |                |
| ---------------   |                                                                |                |
| p\wedge q         |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|
| p\vee q           | ((p\vee q)\wedge (\textlnot p\vee r))\rightarrow (q\vee r)     | Conjucntion    |
| \textlnot p\vee r |                                                                |                |
| ---------------   |                                                                |                |
| q\vee r           |                                                                |                |
|-------------------+----------------------------------------------------------------+----------------|

*** Rules of Inference for Quantifies Statements
|-------------------------+----------------------------|
| Rules of Inference      | Name                       |
|-------------------------+----------------------------|
| \forall (x) P(x)        | Universal Instantiation    |
| ----------------        |                            |
| P(c)                    |                            |
|-------------------------+----------------------------|
| P(x) for an Arbitrary c | Universal Generalization   |
| ----------------        |                            |
| \forall(x) P(x)         |                            |
|-------------------------+----------------------------|
| \exists (x) P(x)        | Existential Instantiation  |
| ----------------        |                            |
| P(c) for some element c |                            |
|-------------------------+----------------------------|
| P(x) for some element c | Existential Generalization |
| ----------------        |                            |
| \exists P(x)            |                            |
|-------------------------+----------------------------|

** Introduction to Proofs
