studyguide.html

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Rules of Inference</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Rules of inference</h4>
<div class="outline-text-4" id="text-1-6-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Rule of Inference</th><th scope="col" class="left">Tautology</th><th scope="col" class="left">Name</th></tr>
</thead>
<tbody>
<tr><td class="left">p</td><td class="left">(p&and; (p &rarr; q)) &rarr; q</td><td class="left">Modus Ponens</td></tr>
<tr><td class="left">p &rarr; q</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">q</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">\textlnot q</td><td class="left">(\textlnot q &and; (p &rarr; q)) &rarr; \textlnot p</td><td class="left">Modus Tollens</td></tr>
<tr><td class="left">p &rarr; q</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">\textlnot p</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p &rarr; q</td><td class="left">((p &or; q) &and; \textlnot p) &rarr; q</td><td class="left">Hypothetical</td></tr>
<tr><td class="left">q &rarr; r</td><td class="left"></td><td class="left">Syllogism</td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">p  &rarr; r</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; q</td><td class="left">p &rarr; (p &or; q)</td><td class="left">Disjunctive</td></tr>
<tr><td class="left">\textlnot p</td><td class="left"></td><td class="left">Syllogism</td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">q</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p</td><td class="left">p &rarr; (p&or; q)</td><td class="left">Addition</td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">p&or; q</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&and; q</td><td class="left">(p&and; q) &rarr; p</td><td class="left">Simplification</td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">p</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p</td><td class="left">((p)&and;(q)) &rarr; (p &and; q)</td><td class="left">Conjunction</td></tr>
<tr><td class="left">q</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">p&and; q</td><td class="left"></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">p&or; q</td><td class="left">((p&or; q)&and; (\textlnot p&or; r))&rarr; (q&or; r)</td><td class="left">Conjucntion</td></tr>
<tr><td class="left">\textlnot p&or; r</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">---------------</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">q&or; r</td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Rules of Inference for Quantifies Statements</h4>
<div class="outline-text-4" id="text-1-6-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Rules of Inference</th><th scope="col" class="left">Name</th></tr>
</thead>
<tbody>
<tr><td class="left">&forall; (x) P(x)</td><td class="left">Universal Instantiation</td></tr>
<tr><td class="left">----------------</td><td class="left"></td></tr>
<tr><td class="left">P(c)</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">P(x) for an Arbitrary c</td><td class="left">Universal Generalization</td></tr>
<tr><td class="left">----------------</td><td class="left"></td></tr>
<tr><td class="left">&forall;(x) P(x)</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">&exist; (x) P(x)</td><td class="left">Existential Instantiation</td></tr>
<tr><td class="left">----------------</td><td class="left"></td></tr>
<tr><td class="left">P(c) for some element c</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">P(x) for some element c</td><td class="left">Existential Generalization</td></tr>
<tr><td class="left">----------------</td><td class="left"></td></tr>
<tr><td class="left">&exist; P(x)</td><td class="left"></td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Introduction to Proofs</h3>
<div class="outline-text-3" id="text-1-7">


</div>
