studyguide.tex
\subsection{Rules of Inference}
\label{sec-1-6}
\subsubsection{Rules of inference}
\label{sec-1-6-1}


\begin{center}
\begin{tabular}{lll}
\hline
 Rule of Inference  &  Tautology                                                       &  Name            \\
\hline
 p                  &  (p\wedge (p \rightarrow q)) \rightarrow q                       &  Modus Ponens    \\
 p \rightarrow q    &                                                                  &                  \\
 ---------------    &                                                                  &                  \\
 q                  &                                                                  &                  \\
\hline
 \textlnot q        &  (\textlnot q \wedge (p \rightarrow q)) \rightarrow \textlnot p  &  Modus Tollens   \\
 p \rightarrow q    &                                                                  &                  \\
 ---------------    &                                                                  &                  \\
 \textlnot p        &                                                                  &                  \\
\hline
 p \rightarrow q    &  ((p \vee q) \wedge \textlnot p) \rightarrow q                   &  Hypothetical    \\
 q \rightarrow r    &                                                                  &  Syllogism       \\
 ---------------    &                                                                  &                  \\
 p  \rightarrow r   &                                                                  &                  \\
\hline
 p\vee q            &  p \rightarrow (p \vee q)                                        &  Disjunctive     \\
 \textlnot p        &                                                                  &  Syllogism       \\
 ---------------    &                                                                  &                  \\
 q                  &                                                                  &                  \\
\hline
 p                  &  p \rightarrow (p\vee q)                                         &  Addition        \\
 ---------------    &                                                                  &                  \\
 p\vee q            &                                                                  &                  \\
\hline
 p\wedge q          &  (p\wedge q) \rightarrow p                                       &  Simplification  \\
 ---------------    &                                                                  &                  \\
 p                  &                                                                  &                  \\
\hline
 p                  &  ((p)\wedge(q)) \rightarrow (p \wedge q)                         &  Conjunction     \\
 q                  &                                                                  &                  \\
 ---------------    &                                                                  &                  \\
 p\wedge q          &                                                                  &                  \\
\hline
 p\vee q            &  ((p\vee q)\wedge (\textlnot p\vee r))\rightarrow (q\vee r)      &  Conjucntion     \\
 \textlnot p\vee r  &                                                                  &                  \\
 ---------------    &                                                                  &                  \\
 q\vee r            &                                                                  &                  \\
\hline
\end{tabular}
\end{center}
\subsubsection{Rules of Inference for Quantifies Statements}
\label{sec-1-6-2}


\begin{center}
\begin{tabular}{ll}
\hline
 Rules of Inference       &  Name                        \\
\hline
 \forall (x) P(x)         &  Universal Instantiation     \\
 ----------------         &                              \\
 P(c)                     &                              \\
\hline
 P(x) for an Arbitrary c  &  Universal Generalization    \\
 ----------------         &                              \\
 \forall(x) P(x)          &                              \\
\hline
 \exists (x) P(x)         &  Existential Instantiation   \\
 ----------------         &                              \\
 P(c) for some element c  &                              \\
\hline
 P(x) for some element c  &  Existential Generalization  \\
 ----------------         &                              \\
 \exists P(x)             &                              \\
\hline
\end{tabular}
\end{center}
\subsection{Introduction to Proofs}
\label{sec-1-7}
