studyguide.org
*** There are 3 main methods for proofs.
**** Direct Proof 
***** Construct a conditional statement p \rightarrow q
***** Assume p to be true
***** Use rules of inference to then show that when p is true q must be true (p true and q false can not happen)
**** Proof by Contraposition
***** Construct a conditional statement p \rightarrow q
***** Set up the contrapositive to be \textlnot q \rightarrow \textlnot p
***** Prove that if \textlnot q is true then \textlnot p has to be true
**** Proof by Contradiction
***** If we want to prove p is true set up the contradiction to be \textlnot p \rightarrow q
***** Because q is false but \textlnot p \rightarrow q is true we know \textlnotp is false which means p is true
***** You are assuming your premise to be false then attempting to show that the conditional statement is then false
** Proof methods and Strategy
*** Exhaustive Proof
**** Sometimes w cannot prove a theorem using a single argument that holds for all possible cases.
**** Proofs by exhaustion use proof by cases for every element and check examples.
**** Example
***** Prove that (n+1)^3 \ge 3^n if n is a positive integer \le 4
***** To do this test for n = {1,2,3,4}
***** Since for n = {1,2,3,4} 3^n is greater we proved this statement through Proof by Exhaustion
**** Proof by Cases
***** A proof by cases must cover all possible cases that arise in a theorem.
***** Example
****** Prove that if n is an integer than n^2 \ge n
****** We check 3 cases 
****** 1) n = 0; 0^2 = 0 which follows n^2 \ge n
****** 2) n \ge 1; Multiply both sides of the inequality n \ge 1 by the positive integer n. We get n^2 > n*1 for n \ge 1
****** 3) n \le 1; Since n^2 \ge 0 it follows n^2 \ge n
**** Leveraging Proof by Cases
***** 
**** Existence Proofs
***** 
**** Proof Stratagies
***** Forward and Backward Reasoning
***** Adapting Existing Proofs
***** Looking for Counterexamples
* Chapter 2
** Sets
*** Definition
**** A set is an unordered collection of objects. a \in A
**** Set builder notation
***** Set builder notation is used to describe a set.
***** O = {x | x is a positive integer less than 10}
***** O = {x | x < 10 \wedge 2x+1 \in Z+ } 
*** Number sets
**** N = {0,1,2,..,} - Set of Natural Numbers
**** Z = {..., -1,0,1,...,} - Set of Intgers
**** Z+ = {1,2,3,...,} - Set of Positive Integers 
**** Q = {p/q | p \in Z, q /in Z, and q \ne 0} - Set of Rational Numbers
**** R = Set of Real Numbers
**** R+ = Set of positive Real Numbers
**** C = Set of complex numbers
*** Interval Notation
|-------+-----------------------------|
| [a,b] | {a \le x \le b}             |
|-------+-----------------------------|
| [a,b) | {a \le x} \lessthan b }     |
|-------+-----------------------------|
| (a,b] | {a \lessthan x \le b }      |
|-------+-----------------------------|
| (a,b) | {a \lessthan x \lessthan b} |
|-------+-----------------------------|
*** Empty Set
**** Denoted by \emptyset
**** All sets contain the empty set although it does not count as a element when measuring cardinality 
*** Subsets
**** The set A is a subset of B iff every element of A is also in B. Denoted by A \subseteq B
*** Proper Subset
**** The set A is a subset of B iff every element of A is also in B but A \neq B. Denoted by A \subset B
