studyguide.html

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> There are 3 main methods for proofs.</h4>
<div class="outline-text-4" id="text-1-7-1">

<ul>
<li id="sec-1-7-1-1">Direct Proof<br/>
<ul>
<li id="sec-1-7-1-1-1">Construct a conditional statement p &rarr; q<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-1-2">Assume p to be true<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-1-3">Use rules of inference to then show that when p is true q must be true (p true and q false can not happen)<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-7-1-2">Proof by Contraposition<br/>
<ul>
<li id="sec-1-7-1-2-1">Construct a conditional statement p &rarr; q<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-2-2">Set up the contrapositive to be \textlnot q &rarr; \textlnot p<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-2-3">Prove that if \textlnot q is true then \textlnot p has to be true<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-7-1-3">Proof by Contradiction<br/>
<ul>
<li id="sec-1-7-1-3-1">If we want to prove p is true set up the contradiction to be \textlnot p &rarr; q<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-3-2">Because q is false but \textlnot p &rarr; q is true we know \textlnotp is false which means p is true<br/>
</li>
</ul>
<ul>
<li id="sec-1-7-1-3-3">You are assuming your premise to be false then attempting to show that the conditional statement is then false<br/>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Proof methods and Strategy</h3>
<div class="outline-text-3" id="text-1-8">


</div>

<div id="outline-container-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> Exhaustive Proof</h4>
<div class="outline-text-4" id="text-1-8-1">

<ul>
<li id="sec-1-8-1-1">Sometimes w cannot prove a theorem using a single argument that holds for all possible cases.<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-2">Proofs by exhaustion use proof by cases for every element and check examples.<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-3">Example<br/>
<ul>
<li id="sec-1-8-1-3-1">Prove that (n+1)<sup>3</sup> &ge; 3<sup>n</sup> if n is a positive integer &le; 4<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-3-2">To do this test for n = {1,2,3,4}<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-3-3">Since for n = {1,2,3,4} 3<sup>n</sup> is greater we proved this statement through Proof by Exhaustion<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4">Proof by Cases<br/>
<ul>
<li id="sec-1-8-1-4-1">A proof by cases must cover all possible cases that arise in a theorem.<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4-2">Example<br/>
<ul>
<li id="sec-1-8-1-4-2-1">Prove that if n is an integer than n<sup>2</sup> &ge; n<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4-2-2">We check 3 cases<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4-2-3">1) n = 0; 0<sup>2</sup> = 0 which follows n<sup>2</sup> &ge; n<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4-2-4">2) n &ge; 1; Multiply both sides of the inequality n &ge; 1 by the positive integer n. We get n<sup>2</sup> &gt; n*1 for n &ge; 1<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-4-2-5">3) n &le; 1; Since n<sup>2</sup> &ge; 0 it follows n<sup>2</sup> &ge; n<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-8-1-5">Leveraging Proof by Cases<br/>
<ul>
<li><br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-8-1-6">Existence Proofs<br/>
<ul>
<li><br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-8-1-7">Proof Stratagies<br/>
<ul>
<li id="sec-1-8-1-7-1">Forward and Backward Reasoning<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-7-2">Adapting Existing Proofs<br/>
</li>
</ul>
<ul>
<li id="sec-1-8-1-7-3">Looking for Counterexamples<br/>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Chapter 2</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Sets</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Definition</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li id="sec-2-1-1-1">A set is an unordered collection of objects. a &isin; A<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-1-2">Set builder notation<br/>
<ul>
<li id="sec-2-1-1-2-1">Set builder notation is used to describe a set.<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-1-2-2">O = {x | x is a positive integer less than 10}<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-1-2-3">O = {x | x &lt; 10 &and; 2x+1 &isin; Z+ }<br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Number sets</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li id="sec-2-1-2-1">N = {0,1,2,..,} - Set of Natural Numbers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-2">Z = {&hellip;, -1,0,1,&hellip;,} - Set of Intgers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-3">Z+ = {1,2,3,&hellip;,} - Set of Positive Integers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-4">Q = {p/q | p &isin; Z, q /in Z, and q &ne; 0} - Set of Rational Numbers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-5">R = Set of Real Numbers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-6">R+ = Set of positive Real Numbers<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-2-7">C = Set of complex numbers<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Interval Notation</h4>
<div class="outline-text-4" id="text-2-1-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">[a,b]</th><th scope="col" class="left">{a &le; x &le; b}</th></tr>
</thead>
<tbody>
<tr><td class="left">[a,b)</td><td class="left">{a &le; x} \lessthan b }</td></tr>
</tbody>
<tbody>
<tr><td class="left">(a,b]</td><td class="left">{a \lessthan x &le; b }</td></tr>
</tbody>
<tbody>
<tr><td class="left">(a,b)</td><td class="left">{a \lessthan x \lessthan b}</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Empty Set</h4>
<div class="outline-text-4" id="text-2-1-4">

<ul>
<li id="sec-2-1-4-1">Denoted by &empty;<br/>
</li>
</ul>
<ul>
<li id="sec-2-1-4-2">All sets contain the empty set although it does not count as a element when measuring cardinality<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Subsets</h4>
<div class="outline-text-4" id="text-2-1-5">

<ul>
<li id="sec-2-1-5-1">The set A is a subset of B iff every element of A is also in B. Denoted by A \subseteq B<br/>
</li>
</ul>
</div>

</div>
