studyguide.tex
\subsubsection{There are 3 main methods for proofs.}
\label{sec-1-7-1}
\begin{itemize}

\item Direct Proof
\label{sec-1-7-1-1}%
\begin{itemize}

\item Construct a conditional statement p $\rightarrow$ q
\label{sec-1-7-1-1-1}%

\item Assume p to be true
\label{sec-1-7-1-1-2}%

\item Use rules of inference to then show that when p is true q must be true (p true and q false can not happen)
\label{sec-1-7-1-1-3}%
\end{itemize} % ends low level

\item Proof by Contraposition
\label{sec-1-7-1-2}%
\begin{itemize}

\item Construct a conditional statement p $\rightarrow$ q
\label{sec-1-7-1-2-1}%

\item Set up the contrapositive to be \textlnot q $\rightarrow$ \textlnot p
\label{sec-1-7-1-2-2}%

\item Prove that if \textlnot q is true then \textlnot p has to be true
\label{sec-1-7-1-2-3}%
\end{itemize} % ends low level

\item Proof by Contradiction
\label{sec-1-7-1-3}%
\begin{itemize}

\item If we want to prove p is true set up the contradiction to be \textlnot p $\rightarrow$ q
\label{sec-1-7-1-3-1}%

\item Because q is false but \textlnot p $\rightarrow$ q is true we know \textlnotp is false which means p is true
\label{sec-1-7-1-3-2}%

\item You are assuming your premise to be false then attempting to show that the conditional statement is then false
\label{sec-1-7-1-3-3}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Proof methods and Strategy}
\label{sec-1-8}
\subsubsection{Exhaustive Proof}
\label{sec-1-8-1}
\begin{itemize}

\item Sometimes w cannot prove a theorem using a single argument that holds for all possible cases.
\label{sec-1-8-1-1}%

\item Proofs by exhaustion use proof by cases for every element and check examples.
\label{sec-1-8-1-2}%

\item Example
\label{sec-1-8-1-3}%
\begin{itemize}

\item Prove that (n+1)$^3$ $\ge$ 3$^n$ if n is a positive integer $\le$ 4
\label{sec-1-8-1-3-1}%

\item To do this test for n = \{1,2,3,4\}
\label{sec-1-8-1-3-2}%

\item Since for n = \{1,2,3,4\} 3$^n$ is greater we proved this statement through Proof by Exhaustion
\label{sec-1-8-1-3-3}%
\end{itemize} % ends low level

\item Proof by Cases
\label{sec-1-8-1-4}%
\begin{itemize}

\item A proof by cases must cover all possible cases that arise in a theorem.
\label{sec-1-8-1-4-1}%

\item Example
\label{sec-1-8-1-4-2}%
\begin{itemize}

\item Prove that if n is an integer than n$^2$ $\ge$ n
\label{sec-1-8-1-4-2-1}%

\item We check 3 cases
\label{sec-1-8-1-4-2-2}%

\item 1) n = 0; 0$^2$ = 0 which follows n$^2$ $\ge$ n
\label{sec-1-8-1-4-2-3}%

\item 2) n $\ge$ 1; Multiply both sides of the inequality n $\ge$ 1 by the positive integer n. We get n$^2$ > n*1 for n $\ge$ 1
\label{sec-1-8-1-4-2-4}%

\item 3) n $\le$ 1; Since n$^2$ $\ge$ 0 it follows n$^2$ $\ge$ n
\label{sec-1-8-1-4-2-5}%
\end{itemize} % ends low level
\end{itemize} % ends low level

\item Leveraging Proof by Cases
\label{sec-1-8-1-5}%
\begin{itemize}

\item 
%
\end{itemize} % ends low level

\item Existence Proofs
\label{sec-1-8-1-6}%
\begin{itemize}

\item 
%
\end{itemize} % ends low level

\item Proof Stratagies
\label{sec-1-8-1-7}%
\begin{itemize}

\item Forward and Backward Reasoning
\label{sec-1-8-1-7-1}%

\item Adapting Existing Proofs
\label{sec-1-8-1-7-2}%

\item Looking for Counterexamples
\label{sec-1-8-1-7-3}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\section{Chapter 2}
\label{sec-2}
\subsection{Sets}
\label{sec-2-1}
\subsubsection{Definition}
\label{sec-2-1-1}
\begin{itemize}

\item A set is an unordered collection of objects. a $\in$ A
\label{sec-2-1-1-1}%

\item Set builder notation
\label{sec-2-1-1-2}%
\begin{itemize}

\item Set builder notation is used to describe a set.
\label{sec-2-1-1-2-1}%

\item O = \{x | x is a positive integer less than 10\}
\label{sec-2-1-1-2-2}%

\item O = \{x | x < 10 $\wedge$ 2x+1 $\in$ Z+ \}
\label{sec-2-1-1-2-3}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsubsection{Number sets}
\label{sec-2-1-2}
\begin{itemize}

\item N = \{0,1,2,..,\} - Set of Natural Numbers
\label{sec-2-1-2-1}%

\item Z = \{..., -1,0,1,\ldots{},\} - Set of Intgers
\label{sec-2-1-2-2}%

\item Z+ = \{1,2,3,\ldots{},\} - Set of Positive Integers
\label{sec-2-1-2-3}%

\item Q = \{p/q | p $\in$ Z, q /in Z, and q $\ne$ 0\} - Set of Rational Numbers
\label{sec-2-1-2-4}%

\item R = Set of Real Numbers
\label{sec-2-1-2-5}%

\item R+ = Set of positive Real Numbers
\label{sec-2-1-2-6}%

\item C = Set of complex numbers
\label{sec-2-1-2-7}%
\end{itemize} % ends low level
\subsubsection{Interval Notation}
\label{sec-2-1-3}


\begin{center}
\begin{tabular}{ll}
\hline
 [a,b]  &  \{a \le x \le b\}              \\
\hline
 [a,b)  &  \{a \le x\} \lessthan b \}     \\
\hline
 (a,b]  &  \{a \lessthan x \le b \}       \\
\hline
 (a,b)  &  \{a \lessthan x \lessthan b\}  \\
\hline
\end{tabular}
\end{center}
\subsubsection{Empty Set}
\label{sec-2-1-4}
\begin{itemize}

\item Denoted by $\emptyset$
\label{sec-2-1-4-1}%

\item All sets contain the empty set although it does not count as a element when measuring cardinality
\label{sec-2-1-4-2}%
\end{itemize} % ends low level
\subsubsection{Subsets}
\label{sec-2-1-5}
\begin{itemize}

\item The set A is a subset of B iff every element of A is also in B. Denoted by A \subseteq B
\label{sec-2-1-5-1}%
\end{itemize} % ends low level
\subsubsection{Proper Subset}
\label{sec-2-1-6}
\begin{itemize}

\item The set A is a subset of B iff every element of A is also in B but A $\neq$ B. Denoted by A $\subset$ B
\label{sec-2-1-6-1}%
\end{itemize} % ends low level
