studyguide.tex
\subsubsection{Set Cardinality}
\label{sec-2-1-7}
\begin{itemize}

\item If S is a set the cardinality of the set denoted by |S| is the number of UNIQUE elements.
\label{sec-2-1-7-1}%
\begin{itemize}

\item Example S = \{1,2,3,3,4,4,5\} |S| = 5
\label{sec-2-1-7-1-1}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Set Operations}
\label{sec-2-2}
\subsection{Functions}
\label{sec-2-3}
\subsection{Sequences and Summations}
\label{sec-2-4}
\subsection{Cardinality of Sets}
\label{sec-2-5}
\subsection{Matrices}
\label{sec-2-6}




$\emptyset$

\end{document}
